Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter Properties
The ProfileItemParameter type exposes the following members.
Properties
Name | Description
AlblString
 Gets a translated albl string.
CrossSectionNumber
 The number of the cross section the parameter belongs to.
IntegerValue
 The integer value of the profile item parameter.
ParameterUnitType
 Defines the parameter unit type.
Property
 The description of the profile item parameter. Corresponds to the 'Property' in the Tekla Structures profile catalog dialog, and the 'Label in dialog box' in the variable dialog in the Sketch Editor.
StringValue
 The string value of the profile item parameter.
Symbol
 The symbol of the profile item parameter.
Value
 The value of the profile item parameter.
Top
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace